---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSet.Insert(Autodesk.Revit.DB.Electrical.VoltageType)
source: html/aba7c5ee-a720-9c45-2461-93edc3701807.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.Insert Method

Insert the specified voltage type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	VoltageType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.VoltageType`) - The voltage type to be inserted into the set.

## Returns
Returns whether the voltage type was inserted into the set.